from aiogram.types import Message
from aiogram import F
from aiogram.filters.command import Command
from aiogram.enums import ParseMode

from routers import user_router

@user_router.message(F.text == "Гайд 📖")
@user_router.message(Command("guide"))
async def guide(message:Message):
    await message.answer(
"""Ми пропонуємо вам невеликі але дуже корисні завдання для покращення або пітримання ваших навичок з  Python

Задачі бувають трьох типів:
    ✏️ Задачі на написання коду
    💻 Задачі на передбачення результату виконання якогось коду
    🗨️ Задачі де треба обрати правильну відповідь
    
Задачі на написання коду:

Вам буде дано опис завдання.
Ви повинні написати код (прямо в чаті з ботом, або в вашому середовищі розробки, наприклад: VS Code, PyCharm)"""\
"""а потім відправити повідомлення з кодом ботові, в такому форматі:

\\`\\`\\`python
Тут знаходиться ваш код
Він може бути
Будь-якої
Довжини
\\`\\`\\`

Реальний приклад буде виглядати так:
\\`\\`\\`python
print("Навчаюся з PyLearn")
\\`\\`\\`

Таке повідомлення в телеграм буде відображатися прямісінько ось так:
```python
print("Навчаюся з PyLearn")
```
Ключеве слово"python після \\`\\`\\` потрібно лише для підсвітки синтаксису Python прямо в телеграмі, якщо вам не потрібна підсвітка синтаксису, то цим словом можна знехтувати 
""",
parse_mode=ParseMode.MARKDOWN
    )